app/Controllers/Diagnosticos_controller.php

SELECT DISTINCT `id_equipo`
FROM `diagnostico`
---
            $diagnosticosModel = new Diagnosticos_model();

            // Obtener los IDs de equipos que ya tienen un diagnóstico
            $equiposDiagnosticados = $diagnosticosModel->distinct()->select('id_equipo')->findAll();