app/Controllers/Diagnosticos_controller.php

SELECT DISTINCT `id_equipo`
FROM `diagnostico`
---
    public function formularioDiagnostico()
    {
        $equipoModel = new Equipos_model();
        $diagnosticosModel = new Diagnosticos_model();

        // Obtener los IDs de equipos que ya tienen un diagnóstico
        $equiposDiagnosticados = $diagnosticosModel->distinct()->select('id_equipo')->findAll();

SELECT *
FROM `equipo`
WHERE `id_equipo` = '7'
AND `equipo_estado` = 1
 LIMIT 1
---
        $costo_estimado = $request->getPost('costo_estimado');

        $equipoModel = new Equipos_model();
        $equipo = $equipoModel->where('id_equipo', $id_equipo)->where('equipo_estado', 1)->first();

INSERT INTO `diagnostico` (`id_equipo`, `analisis`, `solucion`, `costo_estimado`, `id_usuario`, `fechaDiagnostico`) VALUES ('7', 'sadsdafasfsdadasd', NULL, NULL, '2', '2026-06-07')
---
            'fechaDiagnostico' => date('Y-m-d')
        ];

        if ($diagnosticoModel->insert($diagnosticoData)) {