app/Controllers/Equipos_controller.php

SELECT *
FROM `Cliente`
WHERE `dni` = '12345678'
 LIMIT 1
---
    public function verficarDni($dni)
    {
        $clienteModel = new \App\Models\Clientes_Model();
        return $clienteModel->where('dni', $dni)->first();