app/Controllers/Equipos_controller.php

SELECT *
FROM `Cliente`
WHERE `dni` = '12345678'
 LIMIT 1
---

        // 4. Verificación del DNI contra la tabla `cliente`
        $clienteModel = new \App\Models\Clientes_Model();
        $cliente = $clienteModel->where('dni', $dni_cliente)->first();

SELECT *
FROM `equipo`
WHERE `nroSerie` = '12113'
 LIMIT 1
---
        $equipoModel = new \App\Models\Equipos_model();

        // Buscamos si ya existe algún equipo con ese número de serie en la BD
        $equipoExistente = $equipoModel->where('nroSerie', $nroSerie)->first();

INSERT INTO `equipo` (`nroSerie`, `falla`, `fechaIngreso`, `id_cliente`, `id_tipo`, `id_modelo`, `equipo_estado`) VALUES ('12113', 'dsg', '2026-04-21', '1', '1', '4', 1)
---
        ];

        // 6. Insertar y redirigir
        if ($equipoModel->insert($dataEquipo)) {

SELECT `equipo`.*, `modelo_equipo`.`id_marca`, `tipo_equipo`.`nombre` as `tipo_nombre`, `modelo_equipo`.`nombre` as `modelo_nombre`, `marca`.`nombre` as `marca_nombre`
FROM `equipo`
JOIN `tipo_equipo` ON `tipo_equipo`.`id_tipo` = `equipo`.`id_tipo`
JOIN `modelo_equipo` ON `modelo_equipo`.`id_modelo` = `equipo`.`id_modelo`
JOIN `marca` ON `marca`.`id_marca` = `modelo_equipo`.`id_marca`
WHERE `equipo`.`equipo_estado` = 1
SELECT *
FROM `modelo_equipo`
SELECT *
FROM `marca`
---
    public function listado_equipos()
    {
        $equipo = new \App\Models\Equipos_model();

        // 1. Instanciamos los modelos extra que necesita el Modal
        $tipoModel   = new \App\Models\Tipos_equipos_model();
        $marcaModel  = new \App\Models\Marcas_model();
        $modeloModel = new \App\Models\Modelos_equipos_model();

        $data['equipos'] = $equipo->select('
                equipo.*,
                modelo_equipo.id_marca,
                tipo_equipo.nombre as tipo_nombre,
                modelo_equipo.nombre as modelo_nombre,
                marca.nombre as marca_nombre
               ')
               ->join('tipo_equipo', 'tipo_equipo.id_tipo = equipo.id_tipo')
               ->join('modelo_equipo', 'modelo_equipo.id_modelo = equipo.id_modelo')
               ->join('marca', 'marca.id_marca = modelo_equipo.id_marca')
               ->where('equipo.equipo_estado', 1) // Solo equipos activos
               ->findAll();

        $data['titulo'] = 'Listado de Equipos';

        // 2. Cargamos los datos en el array para que la Vista los encuentre
        $data['tipos']   = $tipoModel->findAll();
        $data['marcas']  = $marcaModel->findAll();
        $data['modelos'] = $modeloModel->findAll();