app/Controllers/Home.php

SELECT *
FROM `categoria_repuesto`
---
    public function stock_repuestos()
    {
        $repuestoModel = new \App\Models\Repuestos_Model();
        $categoriaModel = new \App\Models\Categorias_Model();

        $repuestos = $repuestoModel->select('repuesto.*, categoria_repuesto.nombre AS categoria_nombre')
                               ->join('categoria_repuesto', 'categoria_repuesto.id_categoria_repuesto = repuesto.id_categoria_repuesto')
                               ->findAll();

        $data['repuestos'] = $repuestos;
        $data['categorias'] = $categoriaModel->findAll();