app/Controllers/Reparaciones_Controller.php

    public function index()
    {
        $equiposModel = new Equipos_model();
        $repuestosModel = new Repuestos_Model();
        $diagnosticosModel = new Diagnosticos_model();

        // Obtener IDs de equipos que tienen diagnósticos registrados
        $equiposDiagnosticados = $diagnosticosModel->distinct()->select('id_equipo')->findAll();
        $equiposDiagnosticadosIds = array_column($equiposDiagnosticados, 'id_equipo');

        // Obtener equipos que tienen diagnósticos y están activos (estado 1)
        $equipos = $equiposModel->select('equipo.id_equipo, equipo.nroSerie, equipo.equipo_estado,
                                         tipo_equipo.nombre as tipo_nombre,
                                         marca.nombre as marca_nombre,
                                         modelo_equipo.nombre as modelo_nombre')
                                ->join('tipo_equipo', 'tipo_equipo.id_tipo = equipo.id_tipo')
                                ->join('modelo_equipo', 'modelo_equipo.id_modelo = equipo.id_modelo')
                                ->join('marca', 'marca.id_marca = modelo_equipo.id_marca')
                                ->where('equipo.equipo_estado', 1)
                                ->whereIn('equipo.id_equipo', !empty($equiposDiagnosticadosIds) ? $equiposDiagnosticadosIds : [0])
                                ->findAll();

        // Obtener todos los repuestos disponibles
        $repuestos = $repuestosModel->select('id_repuesto, nombre, cantidad')
                                    ->where('cantidad >', 0)
                                    ->findAll();
---
SELECT DISTINCT `id_equipo`
FROM `diagnostico`
SELECT `equipo`.`id_equipo`, `equipo`.`nroSerie`, `equipo`.`equipo_estado`, `tipo_equipo`.`nombre` as `tipo_nombre`, `marca`.`nombre` as `marca_nombre`, `modelo_equipo`.`nombre` as `modelo_nombre`
FROM `equipo`
JOIN `tipo_equipo` ON `tipo_equipo`.`id_tipo` = `equipo`.`id_tipo`
JOIN `modelo_equipo` ON `modelo_equipo`.`id_modelo` = `equipo`.`id_modelo`
JOIN `marca` ON `marca`.`id_marca` = `modelo_equipo`.`id_marca`
WHERE `equipo`.`equipo_estado` = 1
AND `equipo`.`id_equipo` IN ('4','6','7','8','11','12')
SELECT `id_repuesto`, `nombre`, `cantidad`
FROM `Repuesto`
WHERE `cantidad` > 0

    public function guardarReparacion()
    {
        $request = \Config\Services::request();
        $equiposModel = new Equipos_model();
        $repuestosModel = new Repuestos_Model();

        $id_equipo = $request->getPost('id_equipo');
        $observaciones = $request->getPost('observaciones');
        $repuestos_json = $request->getPost('repuestos_json');

        // Validaciones
        if (empty($id_equipo)) {
            return redirect()->back()->with('mensaje_error', 'Debes seleccionar un equipo');
        }

        // Decodificar el JSON de repuestos
        $repuestosUsados = json_decode($repuestos_json, true);

        if (empty($repuestosUsados)) {
            return redirect()->back()->with('mensaje_error', 'Debes agregar al menos un repuesto');
        }

        // Verificar que el equipo exista
        $equipo = $equiposModel->find($id_equipo);
---
SELECT *
FROM `equipo`
WHERE `equipo`.`id_equipo` = '4'

            $cantidad_usada = $repuesto['cantidad'];

            // Obtener el repuesto
            $repuestoData = $repuestosModel->find($id_repuesto);
---
SELECT *
FROM `Repuesto`
WHERE `Repuesto`.`id_repuesto` = '2'

            $nuevo_stock = $repuestoData['cantidad'] - $cantidad_usada;

            // Actualizar stock del repuesto
            $repuestosModel->update($id_repuesto, ['cantidad' => $nuevo_stock]);
---
UPDATE `Repuesto` SET `cantidad` = 4
WHERE `Repuesto`.`id_repuesto` IN ('2')

        }

        // Actualizar el estado del equipo a inactivo (reparado y fuera del sistema)
        $equiposModel->update($id_equipo, [
            'equipo_estado' => 0
        ]);
---
UPDATE `equipo` SET `equipo_estado` = 0
WHERE `equipo`.`id_equipo` IN ('4')